InformationRegisters/КэшОписанияОстатковИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КэшОписанияОстатковИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВозрастныеКатегорииИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевойПол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦелевойПолИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КэшОписанияОстатковИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ОбновлениеИнформационнойБазыГосИС.ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
		Обработчики,
		Метаданные.РегистрыСведений.КэшОписанияОстатковИСМП,
		Новый УникальныйИдентификатор("782ad398-2fb7-4164-88d8-abd920e22a6d"));
	
КонецПроцедуры

// Регистрирует данные для обработчика обновления перехода на конструктор настроек
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.КэшОписанияОстатковИСМП;
	ОбновлениеИнформационнойБазыИСМП.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистрСведений(
		ОбъектМетаданных, Параметры, "ТоварнаяГруппа");
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.КэшОписанияОстатковИСМП;
	ОбновлениеИнформационнойБазыИСМП.ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистраСведений(
		ОбъектМетаданных, Параметры, "ТоварнаяГруппа");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТаблицуПредставленийGTINОстатки(
	ИсходныеДанные,
	Организация = Неопределено,
	ТоварнаяГруппа = Неопределено,
	ИмяКолонкиПредставление = "ПредставлениеGTINОстатки") Экспорт
	
	СоответствиеGTIN = Новый Соответствие();
	МассивGTIN       = Новый Массив();
	НачалоGTIN       = ИнтеграцияИСМПСлужебныйКлиентСервер.НачалоGTINМаркировкиОстатков();
	СтрокиБезGTIN    = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из ИсходныеДанные Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.GTIN) Тогда
			СтрокиБезGTIN.Добавить(СтрокаТаблицы);
			СтрокаТаблицы[ИмяКолонкиПредставление] = "";
			Продолжить;
		ИначеЕсли Не СтрНачинаетсяС(СтрокаТаблицы.GTIN, НачалоGTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы[ИмяКолонкиПредставление] = "";
		
		МассивСтрок = СоответствиеGTIN.Получить(СтрокаТаблицы.GTIN);
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив();
			СоответствиеGTIN.Вставить(СтрокаТаблицы.GTIN, МассивСтрок);
		КонецЕсли;
		
		МассивСтрок.Добавить(СтрокаТаблицы);
		
		МассивGTIN.Добавить(СтрокаТаблицы.GTIN);
		
	КонецЦикла;
	
	МассивGTIN = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивGTIN);
	
	Если МассивGTIN.Количество() > 0 Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КэшОписанияОстатковИСМП.GTIN           КАК GTIN,
			|	КэшОписанияОстатковИСМП.ТоварнаяГруппа КАК ТоварнаяГруппа,
			|	КэшОписанияОстатковИСМП.Представление  КАК " + ИмяКолонкиПредставление + "
			|ИЗ
			|	РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатковИСМП
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &Организация = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ КэшОписанияОстатковИСМП.Организация = &Организация
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ТоварнаяГруппа = НЕОПРЕДЕЛЕНО
			|			ИЛИ КэшОписанияОстатковИСМП.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппыГИСМТ.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ КэшОписанияОстатковИСМП.ТоварнаяГруппа = &ТоварнаяГруппа
			|	КОНЕЦ
			|	И КэшОписанияОстатковИСМП.GTIN В (&МассивGTIN)";
		
		Запрос.УстановитьПараметр("МассивGTIN",     МассивGTIN);
		Запрос.УстановитьПараметр("Организация",    Организация);
		Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивПолейЗаполнения = Новый Массив();
		МассивПолейЗаполнения.Добавить(ИмяКолонкиПредставление);
		
		Если Не ЗначениеЗаполнено(ТоварнаяГруппа) Тогда
			МассивПолейЗаполнения.Добавить("ТоварнаяГруппа");
		КонецЕсли;
		
		СписокСвойств = СтрСоединить(МассивПолейЗаполнения, ",");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокиТаблицы = СоответствиеGTIN.Получить(ВыборкаДетальныеЗаписи.GTIN);
			
			Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаДетальныеЗаписи, СписокСвойств);
			КонецЦикла;
			
			СоответствиеGTIN.Удалить(ВыборкаДетальныеЗаписи.GTIN);
			
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СоответствиеGTIN Цикл
			
			СтрокиТаблицы = КлючИЗначение.Значение;
			
			Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
				СтрокаТаблицы[ИмяКолонкиПредставление] = ИнтеграцияИСМПКлиентСервер.ПредставлениеGTINОстаткиПоВидуПродукции(
					СтрокаТаблицы[ИмяКолонкиПредставление], ТоварнаяГруппа);
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СтрокиБезGTIN Цикл
		СтрокаТаблицы[ИмяКолонкиПредставление] = ИнтеграцияИСМПКлиентСервер.ПредставлениеGTINОстаткиПоВидуПродукции(
			СтрокаТаблицы[ИмяКолонкиПредставление], ТоварнаяГруппа);
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьПредставлениеОписанияОстатков(КешОписанияОстатков) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого КлючИЗначение Из КешОписанияОстатков Цикл
		
		СтрокаКеша     = КлючИЗначение.Значение;
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаКеша.ДанныеОписания);
		МенеджерЗаписи.Организация    = СтрокаКеша.Организация;
		МенеджерЗаписи.ТоварнаяГруппа = СтрокаКеша.ТоварнаяГруппа;
		МенеджерЗаписи.Представление  = СтрокаКеша.Представление;
		МенеджерЗаписи.КодТНВЭД       = СтрокаКеша.КодТНВЭД;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция МассивGTINОписанияОстатков(Организация = Неопределено, ТоварнаяГруппа = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КэшОписанияОстатковИСМП.GTIN
		|ИЗ
		|	РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатковИСМП
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &Организация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ КэшОписанияОстатковИСМП.Организация = &Организация
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ТоварнаяГруппа = НЕОПРЕДЕЛЕНО 
		|				ИЛИ КэшОписанияОстатковИСМП.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппыГИСМТ.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ КэшОписанияОстатковИСМП.ТоварнаяГруппа = &ТоварнаяГруппа
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	
	МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("GTIN");
	
	Возврат МассивЗначений;
	
КонецФункции

Функция ДанныеДляПоискаПриЗаполненииGTIN(ПараметрыЗаполнения) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КэшОписанияОстатковИСМП.GTIN,
		|	КэшОписанияОстатковИСМП.ВозрастнаяКатегория,
		|	КэшОписанияОстатковИСМП.Модель,
		|	КэшОписанияОстатковИСМП.Представление,
		|	КэшОписанияОстатковИСМП.СпособВводаВОборот,
		|	КэшОписанияОстатковИСМП.ТоварныйЗнак,
		|	КэшОписанияОстатковИСМП.ЦелевойПол,
		|	КэшОписанияОстатковИСМП.ИдентификаторДокумента,
		|	КэшОписанияОстатковИСМП.КодТНВЭД
		|ИЗ
		|	РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатковИСМП
		|ГДЕ
		|	КэшОписанияОстатковИСМП.ТоварнаяГруппа = &ТоварнаяГруппа
		|	И КэшОписанияОстатковИСМП.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ПараметрыЗаполнения.ТоварнаяГруппа);
	Запрос.УстановитьПараметр("Организация",    ПараметрыЗаполнения.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеПоGTIN = Новый Структура();
		ДанныеПоGTIN.Вставить("НаименованиеПолное",     ВыборкаДетальныеЗаписи.Представление);
		ДанныеПоGTIN.Вставить("ТорговаяМарка",          ВыборкаДетальныеЗаписи.ТоварныйЗнак);
		ДанныеПоGTIN.Вставить("ИдентификаторДокумента", ВыборкаДетальныеЗаписи.ИдентификаторДокумента);
		ДанныеПоGTIN.Вставить("КодТНВЭД",               ВыборкаДетальныеЗаписи.КодТНВЭД);
		
		ВозвращаемоеЗначение.Вставить(ВыборкаДетальныеЗаписи.GTIN, ДанныеПоGTIN);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
